Revit 2027 API
OverrideGraphicSettings.SetCutForegroundPatternId Method
 Sets the ElementId of the cut face foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetCutForegroundPatternId(
	ElementId fillPatternId
)
Public Function SetCutForegroundPatternId (
	fillPatternId As ElementId
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetCutForegroundPatternId(
	ElementId^ fillPatternId
)
member SetCutForegroundPatternId :
        fillPatternId : ElementId -> OverrideGraphicSettings
Parameters
fillPatternId ElementId
 Value of the cut face foreground fill pattern override.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace